CSI API ETABS v1

# e3DFrameType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum e3DFrameType

    Public Enumeration e3DFrameType

    Dim instance As e3DFrameType

    public enum class e3DFrameType

    type e3DFrameType

Members

| Member name| Value| Description
---|---|---|---
| OpenFrame| 0|
| PerimeterFrame| 1|
| BeamSlab| 2|
| FlatPlate| 3|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com